test-code/app/Controllers/LoginRegister.php

SELECT *
FROM `users`
WHERE `username` = 'manisha@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '21'
SELECT *
FROM `membershipplans`
SELECT *
FROM `categories`
SELECT *
FROM `subcategories`
WHERE `c_id` = '1'
---
   public function loggedin()
{
    // Check if user is logged in
    if (!session()->get('logged_in')) {
        return redirect()->to('books/loginRegister');
    }

    // Fetch user data from session
    $user_id = session()->get('user_id');

    // Fetch user data from database
    $model = new UserModel();
    $user = $model->find($user_id);

    // Fetch membership plan data
    $membershipPlanModel = new Membershipplan_model();
    $membershipPlans = $membershipPlanModel->findAll();

    // Fetch categories and their subcategories
    $categoryModel = new Category_model();
    $subcategoryModel = new Subcategory_model();

    // Fetch all categories from the database
    $categories = $categoryModel->findAll();
    $data['categories'] = [];

    // Fetch subcategories for each category
    foreach ($categories as $category) {
        $category['subcategories'] = $subcategoryModel->where('c_id', $category['c_id'])->findAll();